---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.DrawHiddenLine
source: html/2ab82d4f-b35b-e5da-ebba-5b2e8f545484.htm
---
# Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.DrawHiddenLine Property

Indicates if duct or piping is drawn with the line style and gaps specified for hidden lines.

## Syntax (C#)
```csharp
public bool DrawHiddenLine { get; set; }
```